Autodesk.Revit.DB.Electrical.PanelScheduleView.MoveSlotTo(System.Int32,System.Int32,System.Int32,System.Int32)
Move the circuits in the source slot to the specific slot.
Remarks:
If the moving circuit is in a group, all circuits in the group will be moved accordingly.
nMovingRow:
The Row Number of cell to be moved.
nMovingCol:
Start Column Number of cell to be moved.
nToRow:
The Row Number of cell to moved to.
nToCol:
End Column Number of cell to moved to.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nMovingRow is invalid in Body.
-or-
The given column number nMovingCol is invalid in Body.
-or-
The given row number nToRow is invalid in Body.
-or-
The given column number nToCol is invalid in Body.
-or-
There is no circuit at given cell (nMovingRow, nMovingCol).
-or-
Cannot move the circuits at slot (nMovingRow, nMovingCol) to given slot (nToRow, nToCol).

Autodesk.Revit.DB.Electrical.PanelScheduleView.CanMoveSlotTo(System.Int32,System.Int32,System.Int32,System.Int32)
Verifies if can circuits in the source slot to the specific slot.
nMovingRow:
The Row Number of cell to be moved.
nMovingCol:
Start Column Number of cell to be moved.
nToRow:
The Row Number of cell to moved to.
nToCol:
End Column Number of cell to moved to.
Returns:
True if can move circuits in the source slot to the specific slot.

Autodesk.Revit.DB.Electrical.PanelScheduleView.RemoveSpare(System.Int32,System.Int32)
Remove a spare at specific cell.
nRow:
Row Number
nCol:
Column Number
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid spare.
Since:
2018

Autodesk.Revit.DB.Electrical.PanelScheduleView.RemoveSpace(System.Int32,System.Int32)
Remove a space at specific cell.
nRow:
Row Number
nCol:
Column Number
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid space.
Since:
2018

Autodesk.Revit.DB.Electrical.PanelScheduleView.AddSpare(System.Int32,System.Int32)
Add a spare at specific cell.
nRow:
Row Number
nCol:
Column Number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Body.
-or-
The given column number nCol is invalid in Body.
-or-
There is a circuit at given cell (nRow, nCol) already.
Since:
2018

Autodesk.Revit.DB.Electrical.PanelScheduleView.AddSpace(System.Int32,System.Int32)
Add a space at specific cell.
nRow:
Row Number
nCol:
Column Number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Body.
-or-
The given column number nCol is invalid in Body.
-or-
There is a circuit at given cell (nRow, nCol) already.
Since:
2018

Autodesk.Revit.DB.Electrical.PanelScheduleView.IsSpace(System.Int32,System.Int32)
Check if the selected cell is a space
nRow:
Row Number
nCol:
Column Number
Returns:
True if the selected cell is a space, false otherwise

Autodesk.Revit.DB.Electrical.PanelScheduleView.IsSpare(System.Int32,System.Int32)
Check if the circuit is a spare
nRow:
Row Number
nCol:
Column Number
Returns:
True if the circuit is a spare, false otherwise

Autodesk.Revit.DB.Electrical.PanelScheduleView.IsSlotGrouped(System.Int32,System.Int32)
Check if the slot is in a group
nRow:
Row Number
nCol:
Column Number
Returns:
It is not in a group if the return value equals to 0. It is in a group if the return value is greater than 0 and the return value is the group number.

Autodesk.Revit.DB.Electrical.PanelScheduleView.IsSlotLocked(System.Int32,System.Int32)
Check if the circuit slot in this cell is locked.
nRow:
Row Number
nCol:
Column Number
Returns:
True if the circuit slot in this cell is locked, false otherwise

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetCombinedParamValue(Autodesk.Revit.DB.SectionType,System.Int32,System.Int32)
Returns the combined parameter text for instance view
sectionType:
Section type
nRow:
Row Number
nCol:
Column Number
Returns:
The combined parameter text
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Electrical.PanelScheduleView.IsColumnInLoadSummary(System.Int32)
Check if this column in the load summary
nCol:
Column Number
Returns:
Check if this column in the load summary

Autodesk.Revit.DB.Electrical.PanelScheduleView.IsRowInCircuitTable(System.Int32)
Check if this row in the circuit table
nRow:
Row Number
Returns:
True if this row in the circuit table, false otherwise.

Autodesk.Revit.DB.Electrical.PanelScheduleView.IsCellInPhaseLoads(System.Int32,System.Int32)
Check if this cell in the phase loads
nRow:
Row Number
nCol:
Column Number
Returns:
True if this cell in the phase loads, false otherwise

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSpareCurrentValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId)
Gets the value of the apparent current parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idCurrentParameter:
One of 4 valid current parameters: RBS_ELEC_APPARENT_CURRENT_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEA_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEB_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEC_PARAM
Returns:
The value of the spare's current parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The current parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.SetSpareCurrentValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId,System.Double)
Sets the value of the apparent current parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idCurrentParameter:
One of 4 valid current parameters: RBS_ELEC_APPARENT_CURRENT_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEA_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEB_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEC_PARAM
value:
The value of the spare's current for the given parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The current parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for value must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSpareLoadValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId)
Gets the value of the apparent load parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idLoadParameter:
One of 4 valid load parameters: RBS_ELEC_APPARENT_LOAD, RBS_ELEC_APPARENT_LOAD_PHASEA, RBS_ELEC_APPARENT_LOAD_PHASEB, RBS_ELEC_APPARENT_LOAD_PHASEC
Returns:
The value of the spare's load parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The load parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.SetSpareLoadValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId,System.Double)
Sets the value of the apparent load parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idLoadParameter:
One of 4 valid load parameters: RBS_ELEC_APPARENT_LOAD, RBS_ELEC_APPARENT_LOAD_PHASEA, RBS_ELEC_APPARENT_LOAD_PHASEB, RBS_ELEC_APPARENT_LOAD_PHASEC
value:
The value of the spare's load for the given parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The load parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for value must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetCellsBySlotNumber(System.Int32,System.Collections.Generic.IList{System.Int32}@,System.Collections.Generic.IList{System.Int32}@)
Gets cells for the given slot number
nSlotNumber:
Slot Number
RowArr:
The array of Row Number
ColArr:
The array of Col Number

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSlotNumberByCell(System.Int32,System.Int32)
Gets the slot number in the circuit table
nRow:
Column Number
Returns:
Row Number

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetCircuitIdByCell(System.Int32,System.Int32)
Gets the circuit id for the given slot number
nRow:
Row Number
nCol:
Column Number
Returns:
ElementId of the circuit found at the given row and column

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetCircuitByCell(System.Int32,System.Int32)
Gets the circuit element for the given slot number
nRow:
Row Number of the Body Section
nCol:
Column Number of the Body Section
Returns:
The circuit found at the given row and column

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetApparentPhaseValue(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Gets the apparent load for the given phase for the given slotted circuit
circuitId:
Circuit id for the apparent phase value
apparentLoadParam:
The requested apparent load phase parameter
Returns:
The value of the apparent phase
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetLoadClassificationId(System.Int32)
Gets the id of the associated Load Classification at the given row
nRow:
Row number of Load Summary Section
Returns:
The element id of the Load Classification
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Summary.

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetLoadClassificationDemandFactor(System.Int32,System.Int32)
Gets the Demand Factor for given Load Classification
nRow:
Row number of Load Summary Section
nCol:
Column number of Load Summary Section
Returns:
The Demand Factor for the given Load Classification
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Summary.
-or-
The given column number nCol is invalid in Summary.

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetLoadClassificationConnectedCurrent(System.Int32,System.Int32)
Gets the Total Current for given Load Classification
nRow:
Row number of Load Summary Section
nCol:
Column number of Load Summary Section
Returns:
The Connected Current for the given Load Classification
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Summary.
-or-
The given column number nCol is invalid in Summary.

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetLoadClassificationDemandCurrent(System.Int32,System.Int32)
Gets the Demand Current for given Load Classification
nRow:
Row number of Load Summary Section
nCol:
Column number of Load Summary Section
Returns:
The Demand Current for the given Load Classification
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Summary.
-or-
The given column number nCol is invalid in Summary.

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetLoadClassificationConnectedLoad(System.Int32,System.Int32)
Gets the Total Load for given Load Classification
nRow:
Row number of Load Summary Section
nCol:
Column number of Load Summary Section
Returns:
The total load for the given Load Classification
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Summary.
-or-
The given column number nCol is invalid in Summary.

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetLoadClassificationDemandLoad(System.Int32,System.Int32)
Gets the Demand Load for given Load Classification
nRow:
Row number of Load Summary Section
nCol:
Column number of Load Summary Section
Returns:
The Demand Load for the Load Classification
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Summary.
-or-
The given column number nCol is invalid in Summary.

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetLoadClassificationName(System.Int32,System.Int32)
Gets the name of the Load Classification at the given row/column
nRow:
Row Number of the Load Summary Section
nCol:
Column number of Load Summary Section
Returns:
The name of the Load Classification
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Summary.
-or-
The given column number nCol is invalid in Summary.

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetLoadClassificationParamValue(Autodesk.Revit.DB.ElementId,System.Int32,System.Int32)
Gets the load classification parameter value.
parameterId:
Parameter Id of the Load Classification
nRow:
Row Number of the Load Summary Section
nCol:
Column number of Load Summary Section
Returns:
The value of the Load Classification parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid in Summary.
-or-
The given column number nCol is invalid in Summary.

Autodesk.Revit.DB.Electrical.PanelScheduleView.SetParamValue(Autodesk.Revit.DB.SectionType,System.Int32,System.Int32,System.String)
Sets the text for the given cell, returns true if successful, false otherwise
sectionType:
The associated section
nRow:
Row Number of the Section
nCol:
Column Number of the Section
sValue:
String value to set the parameter
Returns:
Returns whether the function succeeded
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
Thrown if there is no parameter at this cell
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if attempt to call on a template

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetParamValue(Autodesk.Revit.DB.SectionType,System.Int32,System.Int32)
Gets the cell's text based on its type
sectionType:
Section of the desired parameter value
nRow:
Row Number of the Section
nCol:
Column Number of the Section
Returns:
The cell's text
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number nRow is invalid.
-or-
The given column number nCol is invalid.
-or-
Thrown if there is no parameter at this cell
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if attempt to call on a template

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetPanel
Gets the panel for this view
Returns:
The id of the panel for this view

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetTemplate
Gets the template for this view (to set the template, you must go through generateInstanceFromTemplate)
Returns:
The template id for this view

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSectionData(Autodesk.Revit.DB.SectionType)
Gets section data that will be written to
sectionType:
The section type
Returns:
The Autodesk.Revit.DB.TableSectionData
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetTableData
Gets table data that can be written to
Returns:
The Autodesk.Revit.DB.Electrical.PanelScheduleData

Autodesk.Revit.DB.Electrical.PanelScheduleView.IsPanelScheduleTemplate
Check if this is a panel schedule template.
Returns:
Check if this is a panel schedule template.

Autodesk.Revit.DB.Electrical.PanelScheduleView.GenerateInstanceFromTemplate(Autodesk.Revit.DB.ElementId)
Assigns the data from the template to the instance and performs any tasks specific to the instance (3rd phase, borders, etc)
templateId:
Element id of the template element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleView.CreateInstanceView(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of this view (using specific template)
ADoc:
The Document
templateId:
The templateId that this function will use
panelId:
Element id of the electrical panel element.
Returns:
The PanelScheduleView
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleView.CreateInstanceView(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of this view (using default template)
ADoc:
The Document
panelId:
Element id of the electrical panel element.
Returns:
The PanelScheduleView
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.PanelScheduleView
An instance of a panel schedule view.